InformationRegisters/СведенияОПрописанныхЖильцах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПрописанныхЖильцах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прописан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Жилец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УправлениеСоставомЖильцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеСоставомЖильцов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СобственникиОбектовЛицевыхСчетов</xr:Item>
				<xr:Item>InformationRegister.СведенияОПрописанныхЖильцах</xr:Item>
				<xr:Item>InformationRegister.СведенияОПроживающихЖильцах</xr:Item>
				<xr:Item>InformationRegister.СтепеньРодстваФизическихЛиц</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Жильцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Жилец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собственник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСобственности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействияПрописки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПериодаПроживания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыРодственныхСвязей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прописан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проживает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаПроживания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/СтолСправок/Ext/Form/Module.bsl
&НаКлиенте
Процедура СменитьРабочийСтол(Команда)
	
	ОткрытьФорму("Обработка.УправлениеРабочимСтолом.Форма.Форма");
	
КонецПроцедуры


&НаКлиенте
Процедура ЖилецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыйМассив = ПолучитьПрописанныхЖильцов(ЛицевойСчет, ТекущаяДата());
	
	ФиксированныйМассивФизЛиц = Новый ФиксированныйМассив(НовыйМассив);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ФиксированныйМассивФизЛиц);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Жилец.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры

// Функция возвращает список прописанных жильцов.
//
&НаСервере
Функция ПолучитьПрописанныхЖильцов(ЛицевойСчет, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПрописанныхЖильцахСрезПоследних.Жилец
		|ИЗ
		|	РегистрСведений.СведенияОПрописанныхЖильцах.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК СведенияОПрописанныхЖильцахСрезПоследних
		|ГДЕ
		|	СведенияОПрописанныхЖильцахСрезПоследних.Прописан = ИСТИНА";
		
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет); 
	Запрос.УстановитьПараметр("Период", Дата); 
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Жилец");
	
КонецФункции


&НаКлиенте
Процедура ПечатьСправкаОПрописке(Команда)
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
		
		МассивСсылкаЛицевогоСчета = Новый Массив;
		МассивСсылкаЛицевогоСчета.Добавить(ЛицевойСчет);
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "СправкаОПрописке", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОПрописке", Неопределено, Неопределено, Неопределено);	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура БланкСправкаОПрописке(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОПрописке", Неопределено, Неопределено, Неопределено);

КонецПроцедуры


&НаКлиенте
Процедура ПечатьСправкиОСостоянииСемьи(Команда)
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
		
		МассивСсылкаЛицевогоСчета = Новый Массив;
		МассивСсылкаЛицевогоСчета.Добавить(ЛицевойСчет);
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетСправкиПрописанных", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОСоставеСемьи", Неопределено, Неопределено, Неопределено);	

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьФормаА1(Команда)
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ТекущийЖитель",Жилец);
		
		МассивСсылкаЛицевогоСчета = Новый Массив;
		МассивСсылкаЛицевогоСчета.Добавить(ЛицевойСчет);
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "МакетКарточкиПрописки", МассивСсылкаЛицевогоСчета, ЭтаФорма, ПараметрыПечати);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ФормаА1", Неопределено, Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура БланкСправкиОСоставеСемьи(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "СправкаОСоставеСемьи", Неопределено, Неопределено, Неопределено);	

КонецПроцедуры


&НаКлиенте
Процедура БланкФормаА1(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ФормаА1", Неопределено, Неопределено, Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура БланкТалонПрибытия(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ТалонПрибытия", Неопределено, Неопределено, Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура БланкЗаявлениеОРегистрации(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ЗаявлениеОРегистрации", Неопределено, Неопределено, Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура БланкТалонаУбытия(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ТалонУбытия", Неопределено, Неопределено, Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура БланкЗаявленияНаСнятиеСРегистрации(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УправлениеСоставомЖильцов", "ЗаявлениеОВыписке", Неопределено, Неопределено, Неопределено);
КонецПроцедуры
